{
    id: 'it_10113',
    title: 'Scrumboard',
    texte: [
        "Scrum's transparency comes from openly viewable information tools like the Scrumboard, which shows the progress of the team. The team uses a Scrumboard to plan and track progress during each Sprint. The Scrumboard contains four columns to indicate the progress of the estimated tasks for the Sprint: a ‘To Do’ column for tasks not yet started, an ‘In Progress’ column for the tasks started but not yet completed, a ‘Testing’ column for tasks completed but in the process of being tested, and a ‘Done’ column for the tasks that have been completed and successfully tested. At the beginning of a Sprint, all tasks for that Sprint are placed in the ‘To Do’ column and are subsequently moved forward according to their progress.",
        'The Scrumboard should preferably be maintained manually on paper or a white board, but can also be maintained electronically in a spreadsheet.',
        'The Scrum Team should change or add to the Scrumboard as required so that the Scrumboard provides visual information and control about the work going on as agreed and committed by the team.'
    ]
}

{
    id: 'it_10114',
    title: 'Impediment Log',
    texte: [
        'An impediment is any hindrance or hurdle that reduces the productivity of the Scrum Team. Impediments must be identified, resolved and removed if the team is to continue working effectively. Impediments can be internal to the team, such as inefficient workflow or lack of communication, or they can be external.',
        'Examples of external impediments might include software license issues or unnecessary documentation requirements. The Scrum framework, with its inherent transparency, facilitates the swift and easy identification of impediments. Failure to identify or deal with impediments can be very costly. Impediments should be formally recorded by the Scrum Master in an Impediment Log, and can be discussed during Daily Standup Meetings and Sprint Review Meetings as appropriate.'
    ]
}

{
    id: 'it_10117',
    title: 'Scrum Guidance Body Recommendations',
    texte: [
        'Described in section 8.1.1.12.',
        'In the Create Deliverables process, Scrum Guidance Body Recommendations may include best practices to effectively create deliverables, including preferred methods to conduct reviews, testing, documentation, etc.'
    ]
}

{
    id: 'it_10121',
    title: 'Team Expertise',
    texte: [
       'This refers to the collective expertise of the Scrum Team members to understand the User Stories and tasks in the Sprint Backlog in order to create the final deliverables. Team Expertise is used to assess the inputs needed to execute the planned work of the project. This judgment and expertise are applied to all technical and management aspects of the project during the Create Deliverables process. Scrum Team members have the authority and responsibility to determine the best means for converting the Prioritized Product Backlog Items into finished products, without requiring involvement of any stakeholders outside the team.',
       'Additional expertise is available from the Scrum Guidance Body, as required.'
    ]
}

{
    id: 'it_10122',
    title: 'Software',
    texte: [
       'Automated Software tools can be used for scheduling, information collection, and distribution. Virtual collaboration tools are also essential in projects where the Scrum Team is not colocated. A variety of automated software-based tools are available, which enable tracking progress, data collection, and distribution, and contribute to speeding up processes.' 
    ]
}

{
    id: 'it_10123',
    title: 'Other Development Tools',
    texte: [
        'Based on the specific requirements of the project and industry specifications, other development tools can be used accordingly.',
        '1. Refactoring',
        'Refactoring is a tool specific to software projects. The aim of this technique is to improve the maintainability of the existing code and make it simpler, more concise, and more flexible.',
        'Refactoring means improving the design of the present code without changing how the code behaves. It involves the following:',
        '• Eliminating repetitive and redundant code',
        '• Breaking methods and functions into smaller routines',
        '• Clearly defining variables and method names',
        '• Simplifying the code design',
        '• Making the code easier to understand and modify',
        'Regular refactoring optimizes code design a little at a time, over a period of time. Ultimately, refactoring results in cleaner, more maintainable code, while preserving all functionalities.',
        '2. Design Patterns',
        'Design Patterns provide a formal way of recording a resolution to a design problem in a specific field of expertise. These patterns record both the process used and the actual resolution, which can later be reused to improve decision making and productivity.'
    ]
}

{
    id: 'it_10124',
    title: 'Scrum Guidance Body Expertise',
    texte: [
        'Described in section 8.4.2.7.',
        'In Create Deliverables and Approve, Estimate and Commit User Stories processes, Scrum Guidance Body Expertise could relate to documented rules and regulations, development guidelines; or standards and best practices (e.g., guidance on how to conduct reviews or testing). There may also be a team of subject matter experts who may provide guidance to the Scrum Team in creating deliverables. This team could include Lead Architects, Senior Developers, Security Experts, or other experienced persons.'
    ]
}

{
    id: 'it_10131',
    title: 'Sprint Deliverables',
    texte: [
        'At the end of each Sprint, a product increment or deliverable is completed. The deliverable should possess all features and functionality defined in the User Stories included in the Sprint and should have been tested successfully.'
    ]
}

{
    id: 'it_10132',
    title: 'Updated Scrumboard',
    texte: [
        'The Scrumboard is updated regularly as the team keeps completing tasks. However, at the end of the Sprint, the Scrumboard will be reset or wiped off and a new Scrumboard is created for the next Sprint.'
    ]
}

{
    id: 'it_10136',
    title: 'Mitigated Risks',
    texte: [
        'As the Scrum Team executes the work of creating deliverables according to the User Stories in the Product Backlog, they carry out the mitigating actions that have been defined to address any previously Identified Risks. Throughout the Create Deliverables process, the team documents any newly Identified Risks and mitigating actions taken. The record of project risks is a living document, continuously updated throughout the project by the team to reflect the current status of all risks.',
        'Additional information about Managing Risks is described in section 7.4.3'
    ]
}

{
    id: 'it_10216',
    title: 'Previous Work Day Experience',
    texte: [
        'The Scrum Team members give status updates to fellow team members in the Daily Standup Meeting. This session is called a Standup because members stand throughout the meeting. Team members discuss achievements and experience from the previous work day. This experience is an important input to the Daily Standup Meeting.'
    ]
}

{
    id: 'it_10221',
    title: 'Daily Standup Meeting',
    texte: [
        'The Daily Standup Meeting is a short daily meeting, Time-boxed to 15 minutes. Team members assemble to report their progress in the Sprint and plan the day’s activities. The meeting duration is very short and all members of the Scrum Team are expected to attend. However, the meeting is not cancelled or delayed if one or more members are not able to attend.',
        'In the meeting, each Scrum Team member provides answers to the Three Daily Questions as mentioned in section 10.2.2.2. Discussions between the Scrum Master and the team or between some Scrum Team members are encouraged, but such discussions happen after the meeting to ensure that the Daily Standup Meeting is short.'
    ]
}

{
    id: 'it_10222',
    title: 'Three Daily Questions',
    texte: [
       'In the Daily Standup Meeting, facilitated by the Scrum Master, each Scrum Team member provides information in the form of answers to three specific questions:',
       '• What did I complete yesterday?',
       '• What will I complete today?',
       '• What impediments or obstacles (if any) am I currently facing?',
       'By focusing on these three questions, the entire team can have a clear understanding of the work status.',
       'Occasionally, other items may be discussed, but this is kept to a minimum in light of the Time-boxed nature of the meeting.',
       'It is highly recommended that the first two questions should be answered by team members in a quantifiable manner if possible, instead of qualitative lengthy answers. Team members can organize additional meetings after the daily Standup Meeting to address items that need additional discussion.'
    ]
}

{
    id: 'it_10223',
    title: 'War Room',
    texte: [
        'In Scrum, it is preferable for the team to be colocated, with all team members working in the same location.',
        'The term commonly used to describe this place is the War Room. Normally, it is designed in such a way that team members can move around freely, work, and communicate easily because they are located in close proximity to each other. Typically index cards, sticky notes, and other low-tech, high-touch tools are made available in the room to facilitate workflow, collaboration, and problem solving.',
        'The room is sometimes noisy due to team conversations, but these conversations contribute to the team’s progress. A good War Room is cubicle free and allows the entire team to sit together ensuring face-to-face communication, which leads to team building and openness. The War Room is ideal for conducting Daily Standup Meetings as well.',
        'Stakeholder(s) members from other Scrum Teams could also walk by the War Room and discuss relevant issues.'
    ]
}

{
    id: 'it_10224',
    title: 'Video Conferencing',
    texte: [
        'In real-life situations, it may not always be possible for the entire Scrum Team to be colocated. In such cases, it becomes imperative to use video conferencing tools to enable face-to-face communication.'
    ]
}

{
    id: 'it_10233',
    title: 'Motivated Scrum Team',
    texte: [
        'Daily Standup Meetings propagate the idea that each member of the team is important and is a major contributor, which improves individual and team morale. This, along with the concept of self-organizingteams, improves overall motivation, leads to enhanced performance of the team and improved quality of deliverables produced.',
        'Scrum Team is described in section 8.3.3.1.'
    ]
}

{
    id: 'it_10311',
    title: 'Scrum Core Team',
    texte: [
       'Described in sections 8.1.3.1, 8.2.3.1, and 8.3.3.1.' 
    ]
}

{
    id: 'it_10313',
    title: 'Rejected Deliverables',
    texte: [
        'In cases where a deliverable does not meet the Acceptance Criteria, it is considered a Rejected Deliverable.',
        "The Rejected Deliverables are normally not kept in a separate list. They simply remain in the Prioritized Product Backlog and don't get marked as done so that they can be reprioritized in the Groom Prioritized Product Backlog process and be considered for development in the next Sprint."
    ]
}

{
    id: 'it_10317',
    title: 'Updated Program Product Backlog',
    texte: [
        'Similar to the Project Product Backlog, the Program Product Backlog may also undergo periodic grooming to incorporate changes and new requirements. Changes to the Program Product Backlog can result from changes in either external or internal conditions. External conditions might include changing business scenarios, technology trends, or legal compliance requirements. Internal factors affecting the Program Product Backlog could be related to modifications in organizational strategy or policies, Identified Risks and other factors. Changes in requirements in the Program Product Backlog often impact the Project Product Backlogs of underlying projects, so they should be taken into account during the Groom Prioritized Product Backlog process.'
    ]
}

{
    id: 'it_103111',
    title: 'Scrum Guidance Body Recommendations',
    texte: [
        'Described in section 8.1.1.12.',
        'In the Groom Prioritized Product Backlog process, Scrum Guidance Body Recommendations may include best practices on how to systematically understand and collate requirements from Stakeholder(s) and Scrum Teams and then properly prioritize the Product Backlog and communicate updates to all relevant persons involved with the Scrum project.'
    ]
}

{
    id: 'it_10321',
    title: 'Prioritized Product Backlog Review Meetings',
    texte: [
        'The Product Owner may have multiple and separate meetings with relevant Stakeholder(s), the Scrum Master, and the Scrum Team to ensure that he or she has enough information to make updates to the Prioritized Product Backlog during the Groom Prioritized Product Backlog process.',
        'The intent of the Prioritized Product Backlog Review Meetings is to ensure that User Stories and Acceptance Criteria are understood and are written properly by the Product Owner so that they reflect the actual stakeholder (customer) requirements and priorities; User Stories are understood by everyone in the Scrum Team; and that high priority User Stories are well-refined so that the Scrum Team can properly estimate and commit to such User Stories.',
        'The Prioritized Product Backlog Review Meetings also ensure that irrelevant User Stories are removed and any Approved Change Requests or Identified Risks are incorporated into the Prioritized Product backlog.'
    ]
}

{
    id: 'it_10322',
    title: 'Communication Techniques',
    texte: [
       'Scrum promotes accurate and effective communication primarily through colocation of the Scrum Team.',
       'Scrum also favors informal, face-to-face interactions over formal written communications. When a Scrum Team needs to be distributed, the Scrum Master should ensure that effective communication techniques are available so that teams can self-organize and work effectively.'
    ]
}

{
    id: 'it_10323',
    title: 'Other Prioritized Product Backlog Grooming Techniques',
    texte: [
        'Some other Prioritized Product Backlog Grooming tools include many of the same tools used for the following processes:',
        '• Develop Epic(s)—Described in section 8.4.2.',
        '• Create Prioritized Product Backlog—Described in section 8.5.2.',
        '• Conduct Release Planning—Described in section 8.6.2.',
        '• Create User Stories—Described in section 9.1.2.',
        '• Approve, Estimate, and Commit User Stories—Described in section 9.2.2.',
        '• Create Tasks—Described in section 9.3.2.',
        '• Estimate Tasks—Described in section 9.4.2.'
    ]
}

{
    id: 'it_10331',
    title: 'Updated Prioritized Product Backlog',
    texte: [
       'Described in section 8.5.3.1.',
       'Prioritized Product Backlog may be updated with new User Stories, new Change Requests, new Identified Risks, updated User Stories, or reprioritization of existing User Stories.'
    ]
}

{
    id: 'it_10332',
    title: 'Updated Release Planning Schedule',
    texte: [
        'Described in section 8.6.3.1.',
        'The Release Planning Schedule may be updated to reflect the impact of new or changed User Stories in the Prioritized Product Backlog.'
    ]
}