{
    id: 'it_11111',
    title: 'Scrum Master or Scrum Team Representatives',
    texte: [
        'Normally, one member from each Scrum Team will represent his or her team in the Scrum of Scrums (SoS) Meeting. In most cases, this is the Scrum Master, but at times someone else may represent the team. A single person may be nominated by the team to represent them in every SoS Meeting, or the representative may change over time, based on who can best fulfill the role depending on current issues and circumstances. Each person involved in the meeting should have the technical understanding to be able to identify instances in which teams could cause each other impediments or delays.'
    ]
}

{
    id: 'it_11114',
    title: 'Meeting Agenda',
    texte: [
        'The main purpose of the Scrum of Scrums (SoS) Meeting is to communicate progress between multiple teams. The Chief Scrum Master (or any Scrum Master who would facilitate the SoS Meeting) may announce an agenda prior to the meeting. This allows individual teams to consider the agenda items in preparation for the SoS Meeting. Any impediments being faced by a team that may also affect other teams, should be indicated so they can be conveyed at the SoS Meeting. In addition, if a team becomes aware of a large scale issue, change or risk that may affect other teams, it should be communicated at the SoS Meeting.'
    ]
}

{
    id: 'it_11117',
    title: 'Outputs from Retrospect Sprint',
    texte: [
        'Outputs from the Retrospect Sprint process may have issues that could impact multiple Scrum Teams and could be used an input to effective Scrum of Scrums (SoS) Meeting.'
    ]
}

{
    id: 'it_11121',
    title: 'Scrum of Scrums Meeting',
    texte: [
        'These are preferably short meetings (but usually not Time-boxed to allow for more sharing of information between teams) where a representative from each Scrum Team meets to share status of the respective teams. The Scrum of Scrums (SoS) Meeting is held at predetermined intervals or when required by Scrum Teams to facilitate the sharing of information among different Scrum Teams. Issues, dependencies, and risks impacting multiple Scrum Teams can be closely monitored, which helps the various teams working on a large project better coordinate and integrate their work. It is the responsibility of the Chief Scrum Master (or another Scrum Master who facilitates the SoS Meetings) to ensure that all representatives have an environment conducive to open and honest sharing of information, including feedback to other team representatives. For larger projects, involving a significant number of teams, multiple levels of these meetings may be convened to share the status of the respective teams.',
        'The SoS Meeting is described in more detail in section 3.7.2.'
    ]
}

{
    id: 'it_11122',
    title: 'Four Questions per Team',
    texte: [
        'Each Scrum Team representative will provide updates from his or her team in turn. These updates are usually provided in the form of answers to four specific questions.',
        '1) What has my team been working on since the last meeting?',
        '2) What will my team do until the next meeting?',
        '3) What were other teams counting on our team to finish that remains undone?',
        '4) What is our team planning on doing that might affect other teams?',
        'The answers to these four questions provide information that allows each team to clearly understand the work status of all other teams.'
    ]
}

{
    id: 'it_11123',
    title: 'Video Conferencing',
    texte: [
        'Described in section to 10.2.2.4',
        'It is very likely that the Scrum of Scrums (SoS) Meeting is not face-to-face. Video conferencing is usually needed for large projects where there is a higher possibility of distributed teams.'
    ]
}

{
    id: 'it_11124',
    title: 'Meeting Room',
    texte: [
        'It is recommended that a dedicated conference room be made available for the SoS Meeting, where all the Scrum Team Representatives are comfortable.'
    ]
}

{
    id: 'it_11125',
    title: 'Scrum Guidance Body Expertise',
    texte: [
        'Also described in section 8.4.2.7.',
        'In the Convene Scrum of Scrums process, Scrum Guidance Body Expertise could relate to documented best practices about how to conduct Scrum of Scrum (SoS) Meetings and incorporate suggestions from such meetings in project work of individual Scrum Teams. There may also be a team of subject matter experts who may help the Chief Scrum Master facilitate the SoS Meeting.'
    ]
}

{
    id: 'it_11131',
    title: 'Better Team Coordination',
    texte: [
        'The Scrum of Scrums (SoS) Meeting facilitates coordination of work across multiple Scrum Teams. This is especially important when there are tasks involving inter-team dependencies. Incompatibilities and discrepancies between the work and deliverables of different teams are quickly exposed. This forum also gives teams the opportunity to showcase their achievements and give feedback to other teams. By using the SoS Meeting, there is collaboration across the organization as opposed to people working in closed teams concerned primarily with their individual responsibilities.'
    ]
}

{
    id: 'it_11132',
    title: 'Resolved Issues',
    texte: [
        'The Scrum of Scrums (SoS) Meeting is a forum where Scrum Team members have the opportunity to transparently discuss issues impacting their project. The need to deliver every Sprint on time forces the teams to actively confront such issues early instead of postponing seeking resolution. This timely discussion and resolution of issues in the SoS Meeting greatly improve coordination between different Scrum Teams and also reduces the need for redesign and rework. Risks related to dependencies and delivery time tables are mitigated as well.',
        'The SoS Meeting is described in more detail in section 3.7.2.1.'
    ]
}

{
    id: 'it_112110',
    title: 'Scrum Guidance Body Recommendations',
    texte: [
        'Described in section 8.1.1.12',
        'In the Demonstrate and Validate Sprint process, Scrum Guidance Body Recommendations may include best practices about how to conduct Sprint Review Meetings and evaluate results from Earned Value Analysis.',
        'Also, there may be guidance about how to share experiences with other persons in the Scrum Core Team and also with other Scrum Teams in the project.'
    ]
}

{
    id: 'it_11221',
    title: 'Sprint Review Meeting',
    texte: [
        'The Scrum Core Team members and relevant Stakeholder(s) participate in Sprint Review Meetings to accept the deliverables which meet the User Story Acceptance Criteria and reject unacceptable deliverables.',
        'These meetings are convened at the end of every Sprint. The Scrum Team demonstrates the achievements from the Sprint, including the new functionalities or products created. This provides an opportunity for the Product Owner and Stakeholder(s) to inspect what has been completed so far and to determine if any changes should be made in the project or processes in subsequent Sprints.'
    ]
}

{
    id: 'it_11222',
    title: 'Earned Value Analysis',
    texte: [
        'Described in section 4.6.1'
    ]
}

{
    id: 'it_11223',
    title: 'Scrum Guidance Body Expertise',
    texte: [
        'Described in section 8.4.2.7.',
        'In the Demonstrate and Validate Sprint process, Scrum Guidance Body Expertise could relate to documented best practices about how to conduct Sprint Review Meetings. There may also be some experts who could help provide guidance on how to better facilitate a Sprint Review Meeting.'
    ]
}

{
    id: 'it_11231',
    title: 'Accepted Deliverables',
    texte: [
        'Deliverables which meet the User Story Acceptance Criteria are accepted by the Product Owner. The objective of a Sprint is to create potentially shippable deliverables, or product increments, which meet the Acceptance Criteria defined by the customer and Product Owner. These are considered Accepted Deliverables that may be released to the customer if they so desire. A list of Accepted Deliverables is maintained and updated after each Sprint Review Meeting. If a deliverable does not meet the defined',
        'Acceptance Criteria, it is not considered accepted and will usually be carried forward into a subsequent Sprint to rectify any issues. This is highly undesirable because the objective of every Sprint is for the deliverables to meet the criteria for acceptance.'
    ]
}

{
    id: 'it_11232',
    title: 'Rejected Deliverables',
    texte: [
        'If Deliverables do not meet the Acceptance Criteria, such Deliverables are rejected. User Stories associated with such Rejected Deliverables get added to the Prioritized Product Backlog so that such deliverables may be considered as part of a subsequent Sprint.'
    ]
}

{
    id: 'it_11234',
    title: 'Earned Value Analysis Results',
    texte: [
        'Described in section 4.6.1.'
    ]
}

{
    id: 'it_11313',
    title: 'Outputs from Demonstrate and Validate Sprint',
    texte: [
        'Described in section 11.2.3.'
    ]
}

{
    id: 'it_11315',
    title: 'Scrum Guidance Body Recommendations',
    texte: [
        'The Scrum Guidance Body may provide guidelines for conducting Retrospect Sprint Meetings, including suggestions for tools to be utilized and documentation or deliverables expected from the meetings.'
    ]
}

{
    id: 'it_11321',
    title: 'Retrospect Sprint Meeting',
    texte: [
       'The Retrospect Sprint Meeting is an important element of the ‘inspect-adapt’ Scrum framework and it is the final step in a Sprint. All Scrum Team members attend the meeting, which is facilitated or moderated by the Scrum Master. It is recommended, but not required for the Product Owner to attend. One team member acts as the scribe and documents discussions and items for future action. It is essential to hold this meeting in an open and relaxed environment to encourage full participation by all team members. Discussions in the Retrospect Sprint Meeting encompass both what went wrong and what went right. Primary objectives of the meeting are to identify three specific items:',
       '1) Things the team needs to keep doing: best practices',
       '2) Things the team needs to begin doing: process improvements',
       '3) Things the team needs to stop doing: process problems and bottlenecks',
       'These areas are discussed and a list of Agreed Actionable Improvements is created.'
    ]
}

{
    id: 'it_11322',
    title: 'Explorer—Shopper—Vacationer—Prisoner (ESVP)',
    texte: [
        'This is an exercise that can be conducted at the start of the Retrospect Sprint Meeting to understand the mindset of the participants and set the tone for the meeting. Attendees are asked to anonymously indicate which best represents how they feel regarding their participation in the meeting.',
        '<b>• Explorer</b>—Wants to participate in and learn everything discussed in the retrospective',
        '<b>• Shopper</b>—Wants to listen to everything and choose what he takes away from the retrospective',
        '<b>• Vacationer</b>—Wants to relax and be a tourist in the retrospective',
        '<b>• Prisoner</b>—Wants to be elsewhere and is attending the retrospective because it is required',
        'The Scrum Master then collates the responses, prepares, and shares the information with the group.'
    ]
}

{
    id: 'it_11323',
    title: 'Speed Boat',
    texte: [
        'Speed boat is a technique that can be used to conduct the Retrospect Sprint Meeting. Team members play the role of the crew on a speed boat. The boat must reach an island, which is symbolic of the project vision.',
        'Sticky notes are used by the attendees to record engines and anchors. Engines help them reach the island, while anchors hinder them from reaching the island. This exercise is Time-boxed to a few minutes. Once all items are documented, the information is collated, discussed, and prioritized by way of a voting process.',
        'Engines are recognized and mitigation actions are planned for the anchors, based on priority.'
    ]
}

{
    id: 'it_11324',
    title: 'Metrics and Measuring Techniques',
    texte: [
        "Various metrics can be used to measure and contrast the team's performance in the current Sprint to their performance in previous Sprints. Some examples of these metrics include:",
        '• Team velocity—Number of story points done in a given Sprint',
        '• Done success rate—Percentage of story points that have been Done versus those committed',
        '• Estimation effectiveness—Number or percentage of deviations between estimated and actual time spent on tasks and User Stories',
        '• Review feedback ratings—Feedback can be solicited from Stakeholder(s) using quantitative or qualitative ratings, providing a measurement of team performance.',
        '• Team morale ratings—Results from self-assessments of team member morale',
        '• Peer feedback—360 degree feedback mechanisms can be used to solicit constructive criticism and insight into team performance',
        '• Progress to release or launch—Business value provided in each release, as well as value represented by the current progress towards a release. This contributes to the motivation of the team and to the level of work satisfaction.'
    ]
}

{
    id: 'it_11325',
    title: 'Scrum Guidance Body Expertise',
    texte: [
        'Also described in section 8.4.2.7.',
        'In the Retrospect Sprint process, Scrum Guidance Body Expertise could relate to the best practices about how to conduct Retrospect Sprint Meetings. There may also be some experts who could help provide guidance on how to use the tools in the Retrospect Sprint process to deliver Agreed Actionable Improvements for the future Sprints.'
    ]
}

{
    id: 'it_11331',
    title: 'Agreed Actionable Improvements',
    texte: [
        'Agreed Actionable Improvements are the primary output of the Retrospect Sprint process. They are the list of actionable items that the team has come up with to address problems and improve processes in order to enhance their performance in future Sprints.'
    ]
}

{
    id: 'it_11332',
    title: 'Assigned Action Items and Due Dates',
    texte: [
        'Once the Agreed Actionable Improvements have been elaborated and refined, action items to implement the improvements may be considered by the Scrum Team. Each action item will have a defined due date for completion.'
    ]
}

{
    id: 'it_11333',
    title: 'Proposed Non-Functional Items for Prioritized Product Backlog',
    texte: [
        'When the initial Prioritized Product Backlog is developed, it is based on User Stories and required functionalities. Often, non-functional requirements may not be fully defined in the early stages of the project and can surface during the Sprint Review or Retrospect Sprint Meetings. These items should be added to the Prioritized Product Backlog as they are discovered. Some examples of non-functional requirements are response times, capacity limitations, and security related issues.'
    ]
}

{
    id: 'it_11334',
    title: 'Retrospect Sprint Log(s)',
    texte: [
        'The Retrospect Sprint Log is a record of the opinions, discussions, and actionable items raised in a Retrospect Sprint Meeting. The Scrum Master could facilitate creation of this log with inputs from Scrum Core Team members. The collection of all Retrospective Sprint Logs becomes the project diary and details project successes, issues, problems, and resolutions. The logs are public documents available to anyone in the organization.'
    ]
}

{
    id: 'it_11335',
    title: 'Scrum Team Lessons Learned',
    texte: [
        'The self-organizing and empowered Scrum Team is expected to learn from any mistakes made during a Sprint. These lessons learned help the teams improve their performance in future Sprints. These lessons learned may also be documented in Scrum Guidance Body Recommendations to be shared with other Scrum Teams.',
        'There may be several positive lessons learned as part of a Sprint. These positive lessons learned are a key part of the retrospective, and should be appropriately shared within the team and with the Scrum Guidance Body, as the teams work towards continuous self-improvement.'
    ]
}

{
    id: 'it_11336',
    title: 'Updated Scrum Guidance Body Recommendations',
    texte: [
        'As a result of a Retrospect Sprint Meeting, suggestions may be made to revise or enhance the Scrum Guidance Body Recommendations. If the Guidance Body accepts these suggestions, these will be incorporated as updates to the Scrum Guidance Body documentation.'
    ]
}

